"""Text parts."""
SEPARATOR = '----------------------------------'

CONT_GAME = 'enter для продолжения игры'

GREETING = 'Добро пожаловать в игру ''Сундук сокровищ''!\n' \
           'Попробуй себя в роли капитана корабля, собери ' \
           'команду и достань все сокровища!'

NAME_QUESTION = 'Как тебя зовут?'

CHOOSE_LEVEL = 'Выбери уровень сложности, он влияет на стоимость ' \
               'сокровищ на островах. \n' \
               '1 - легко \n' \
               '2 - средне \n' \
               '3 - тяжело'

INTRODUCTION = 'В наследство от дядюшки тебе достался корабль, \n' \
               'несколько золотых монет и карта, на которой \n' \
               'отмечены 10 островов. На каждом из островов \n' \
               'зарыт клад. Но для того, чтобы достать его, \n' \
               'необходимо обезвредить ловушку. Чем больше \n' \
               'порядковый номер острова, тем ценнее хранящееся \n' \
               'на нем сокровище и тем труднее его получить. \n\n' \
               'Цель игры - добыть все сокровища и скопить как можно больше монет. \n\n' \
               'Команда твоего корабля сможет обезвредить ловушку, \n' \
               'только если будет иметь нужное количество очков \n' \
               'логики, силы и ловкости. \n\n' \
               '!!! Сумма всех требуемых очков равна номеру острова,\n' \
               'но точная комбинация тебе неизвестна. !!!'

ORACLE_QUESTION = 'Здесь неподалеку живет известный оракул. За определенную\n' \
                  'плату он сможет предсказать с какой ловушкой\n' \
                  'ты столкнешься на острове. Пойдешь ли ты к нему?\n' \
                  '----------------------------------\n'\
                  '1 - да, пойду\n' \
                  '2 - нет, сам разберусь'

ORACLE_QUESTION_1 = 'Что ты хочешь узнать у оракула? \n' \
                    '----------------------------------\n'\
                    '1 - я передумал, буду сам себе оракул! \n'\
                    '2 - сколько очков логики должно быть у команды? (1 монета) \n'\
                    '3 - сколько очков силы должно быть у команды? (1 монета) \n'\
                    '4 - сколько очков ловкости должно быть у команды? (1 монета) \n'\
                    '5 - узнать все требуемые характеристики (3 монеты)'

ORACLE_QUESTION_2 = 'Что ты хочешь узнать у оракула? \n' \
                    '----------------------------------\n'\
                    '1 - я передумал, буду сам себе оракул! \n'\
                    '2 - сколько очков логики должно быть у команды? (1 монета) \n'\
                    '3 - сколько очков силы должно быть у команды? (1 монета) \n'\
                    '4 - сколько очков ловкости должно быть у команды? (1 монета)'

GO_TAVERN_TEXT = 'Отлично! Для похода на остров тебе понадобится \n' \
                 'команда, а нанять ее ты сможешь в таверне.'

EXIT_QUESTION = 'Продолжить игру?\n' \
                '----------------------------------\n'\
                '1 - да\n' \
                '2 - нет'

SUCCESS_STEP = 'Поздравляю! Ты смог достать спрятанное сокровище! \n' \
               'Самое время готовиться к следующему походу.'

FAILURE_STEP = 'К сожалению, ты не смог достать сокровище. \n' \
               'Если у тебя еще остались монеты, то можешь \n' \
               'попробовать организовать поход заново. Удачи!'

WINNING = 'Поздравляю! Ты собрал сокровища со всех окрестных \n' \
          'островов, можешь выкинуть ненужную теперь карту) \n' \
          'Конец игры.'

LOSING = 'Сожалею, ты потратил все деньги. Карьера пиратского \n' \
         'капитана подошла к концу. А дядюшка в тебя верил! \n' \
         'Конец игры.'

NAMES = ['Боб', 'Ричард', 'Алан', 'Степан', 'Грозный Глаз', 'Гарри',
         'Моррис', 'Джек', 'Алекс', 'Сэм', 'Том', 'Янис', 'Геральт',
         'Ринсвинд', 'Купер', 'Борис', 'Джон', 'Рон']
